> Федеральное государственное автономное образовательное учреждение высшего образования «Национальный исследовательский университет ИТМО»
> 
> Университет ИТМО
> 
> Факультет программной инженерии и компьютерной техники
> 
> Направление подготовки 09.03.04 «Программная инженерия» - Системное и прикладное программное обеспечение
> 
> Дисциплина:
> 
> Тестирование программного обеспечения
> 
> Лабораторная работа №1
> 
> Тема: " Модульное тестирование"
> 
> Вариант: 46324 
> 
> Выполнил:
> 
> Гавриш Богдан Вячеславович
> 
> Группа: Р3319
> 
> Преподаватель:
> 
> Тюрин Иван Николаевич
> 
> Санкт-Петербург
> 
> 2026г.

Задание:

### 1. Модульное тестирование разложения функции sin(x) в степенной ряд
taks1

### 2. Модульное тестирование алгоритма B+ дерева
task2

### 3. Тестовое покрытие для доменной модели  
task3

UML:
